# <b>A. <span style='color:#0B2F9F'><code>SUB-QUERY</code></span></b>
Subquery adalah sebuah query (pernyataan SQL) yang terletak di dalam query lain. Subquery dapat digunakan untuk mengambil data yang kemudian akan digunakan oleh query utama.<br><br>

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel customer_demography, hitung rata-rata umur customer dan bulatkan ke dua tempat desimal!</b></i>

In [ ]:
SELECT
  ROUND(AVG(age),2) as avg_age
FROM telco_churn.customer_demography

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel customer_demography, tampilkan customer_id, age dan gendernya dimana umur customer tersebut lebih dari rata-rata umur customer secara keseluruhan!</b></i>

In [ ]:
SELECT
  customer_id,
  age,
  gender
from `telco_churn.customer_demography`
where age > (SELECT ROUND(AVG(age),2) as avg_age FROM telco_churn.customer_demography)

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel customer_demography, ada berapa customer yang lebih dari rata-rata umur customer secara keseluruhan?</b></i>

In [ ]:
SELECT
  COUNT(1) as total_customer
from `telco_churn.customer_demography`
where age > (SELECT ROUND(AVG(age),2) as avg_age FROM telco_churn.customer_demography)

ALIAS

SELECT
  COUNT(age > (SELECT ROUND(AVG(age),2) as avg_age FROM telco_churn.customer_demography)) as total_customer
from `telco_churn.customer_demography`
where age > (SELECT ROUND(AVG(age),2) as avg_age FROM telco_churn.customer_demography)

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel customer_demography, berapa usia termuda dan tertua customer yang lebih dari rata-rata umur customer secara keseluruhan?</b></i>

In [ ]:
SELECT
  MIN(age) as min_age,
  MAX(age) as max_age
from `telco_churn.customer_demography`
where age > (SELECT ROUND(AVG(age),2) as avg_age FROM telco_churn.customer_demography)

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel customer_status, tampilkan semua data dengan cltv kurang dari atau sama dengan rata-rata cltv customer secara keseluruhan dan statusnya selain Churned?</b></i>

In [ ]:
SELECT
  *
from `telco_churn.customer_status`
where cltv <= (SELECT ROUND(AVG(cltv),2) as avg_age FROM telco_churn.customer_status)

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel customer_status, Hitung besarnya presentase setiap status yang ada dan juga jumlah customer tiap statusnya!</b></i>

In [ ]:
SELECT
  status,
  count(customer_id) as total_customer,
  ROUND(count(customer_id)/(SELECT COUNT(customer_id) from `telco_churn.customer_status`)*100,2) as percentage
from `telco_churn.customer_status`
group by status

# <b>B. <span style='color:#0B2F9F'><code>CTE</code></span></b>
CTE, atau Common Table Expression, adalah fitur dalam SQL yang memungkinkan Anda untuk mendefinisikan sebuah query sementara yang dapat digunakan dalam query lain. CTE membantu dalam membuat query lebih mudah dibaca dan dipelihara, serta memungkinkan penggunaan rekursi dalam query.

<img src="https://learnsql.com/blog/sql-common-table-expression-guide/cte_syntax_example.webp" width="50%">

#### <i><b><span style='color:#55679C'>Quest</span> : Hitung jumlah customer pada masing - masing offer & jenis contract!</b></i>

In [ ]:
SELECT
  offer,
  contract,
  count(customer_id) as total_customer,
from `telco_churn.telco_services`
group by offer, contract

#### <i><b><span style='color:#55679C'>Quest</span> : Tampilkan kolom offer & jenis contract dimana jumlah customernya paling besar (saja)!</b></i>

In [ ]:
WITH count_cust AS(
SELECT
  offer,
  contract,
  count(customer_id) as total_customer,
from `telco_churn.telco_services`
group by offer, contract)

SELECT * from count_cust
WHERE total_customer = (SELECT MAX(total_customer) from count_cust)

#### <i><b><span style='color:#55679C'>Quest</span> : Tampilkan customer_id, gender, age, tenure_in_month, total_revenue dan status dengan status = 'Churned' dan internet_type-nya = 'Fiber Optic'! (Terapkan CTE untuk mengoptimasi query ini)!</b></i>

In [ ]:
WITH ChurnedCustomerInfo AS (
    SELECT
        cs.customer_id,
        cd.gender,
        cd.age,
        cs.status
    FROM
        telco_churn.customer_status cs
    JOIN
        telco_churn.customer_demography cd ON cs.customer_id = cd.customer_id
    WHERE
        cs.status = 'Churned'
)
SELECT
    cci.customer_id,
    cci.gender,
    cci.age,
    ts.tenure_in_months,
    ts.total_revenue,
    cci.status
FROM
    ChurnedCustomerInfo cci
JOIN
    telco_churn.telco_services ts ON cci.customer_id = ts.customer_id
WHERE
    ts.internet_type = 'Fiber Optic';